Tekla.Structures.Drawing.Text
The Text class defines a drawing object that can hold a text string and is shown in a drawing.

Tekla.Structures.Drawing.Text.FrameWidth
The width of the text frame

Tekla.Structures.Drawing.Text.FrameHeight
The height of the text frame

Tekla.Structures.Drawing.Text.ResizeBehavior
The text resize behavior.

Tekla.Structures.Drawing.Text.InsertionPoint
The insertion point of the text.

Tekla.Structures.Drawing.Text.TextString
The contents of the text.

Tekla.Structures.Drawing.Text.IsRichText
Gets a value indicating whether the text contains rich text formatting (RTF).
Returns false if the text is plain text or an empty string.

Tekla.Structures.Drawing.Text.Attributes
The attributes for the text.

Tekla.Structures.Drawing.Text.Placing
The current placing of the object.
See the placing types for different placing options.

Tekla.Structures.Drawing.Text.GetAxisAlignedBoundingBox
Returns the axis aligned bounding box of the text (rectangle format).
Returns: The axis aligned bounding box of the text.

Tekla.Structures.Drawing.Text.GetObjectAlignedBoundingBox
Returns the object aligned bounding box of the text (rectangle format).
Returns: The object aligned bounding box of the text.

Tekla.Structures.Drawing.Text.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object using the move vector.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.Text.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Text.#ctor
Create an instance of the object with empty content.

Tekla.Structures.Drawing.Text.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String)
Creates a new text instance with the given text string.
view: The view to be used.
insertionPoint: The insertion point to be used.
text: The text string to be used.

Tekla.Structures.Drawing.Text.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.PlacingBase)
Creates a new text instance with the given text string using a specific placing type.
view: The view to be used.
insertionPoint: The insertion point to be used.
text: The text string to be used.
Placing: The placing type to be used.

Tekla.Structures.Drawing.Text.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.Text.TextAttributes)
Creates a new text instance with the given text string and text attributes.
view: The view to be used.
insertionPoint: The insertion point to be used.
Text: The text string to be used.
inAttributes: The text attributes to be used.

Tekla.Structures.Drawing.Text.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.PlacingBase,Tekla.Structures.Drawing.Text.TextAttributes)
Creates a new text instance with the given text string and text attributes
using a specific placing type.
view: The view to be used.
insertionPoint: The insertion point to be used.
Text: The text string to be used.
Placing: The placing type to be used.
inAttributes: The text attributes to be used.

Tekla.Structures.Drawing.Text.Delete
Deletes the text from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Text.Modify
Modifies the text in the current drawing database.
Throws Tekla.Structures.Drawing.InvalidAttributesForOperationException: Thrown if Attributes contains values that are not supported by the object.
Returns: True on success.

Tekla.Structures.Drawing.Text.Insert
Inserts the text into the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Text.Select
Selects the text from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Text.GetObjects
Gets the children objects of the current object.
Returns: The children objects of the current object.

Tekla.Structures.Drawing.Text.GetObjects(System.Type[])
Gets the children objects of the current object that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The children objects of the current object that are of certain types.

Tekla.Structures.Drawing.Text.Hideable
Accesses the information if this object is hidden or not or if it should be.

Tekla.Structures.Drawing.Text.TextDrawMode
Setting to draw on a plane or follow camera.